from bs4 import BeautifulSoup as bs
import requests
import re
from fake_useragent import UserAgent
from NeuroLand import additional_data

HEADERS = {
	'User-Agent': UserAgent(verify_ssl=False).chrome
}
city = {
	"1": "Камчатский край",
	"2": "Марий Эл",
	"3": "Чечня",
	"4": "Оренбургская область",
	"5": "Ямало-Ненецкий АО",
	"6": "Забайкальский край",
	"7": "Ярославская область",
	"8": "Владимирская область",
	"9": "Бурятия",
	"10": "Калмыкия",
	"11": "Белгородская область",
	"12": "Вологодская область",
	"13": "Волгоградская область",
	"14": "Калужская область",
	"15": "Ингушетия",
	"16": "Кабардино-Балкария",
	"17": "Иркутская область",
	"18": "Ивановская область",
	"19": "Астраханская область",
	"20": "Карачаево-Черкесия",
	"21": "Новгородская область",
	"22": "Курганская область",
	"23": "Костромская область",
	"24": "Краснодарский край",
	"25": "Магаданская область",
	"26": "Нижегородская область",
	"27": "Кировская область",
	"28": "Липецкая область",
	"29": "Мурманская область",
	"30": "Курская область",
	"31": "Мордовия",
	"32": "Хакасия",
	"33": "Карелия",
	"34": "Якутия",
	"35": "Татарстан",
	"36": "Адыгея",
	"37": "Омская область",
	"38": "Пензенская область",
	"39": "Псковская область",
	"40": "Северная Осетия",
	"41": "Башкортостан",
	"42": "Пермский край",
	"43": "Ростовская область",
	"44": "Дагестан",
	"45": "Приморский край",
	"46": "Орловская область",
	"47": "Томская область",
	"48": "Тверская область",
	"49": "Удмуртия",
	"50": "Ставропольский край",
	"51": "Ульяновская область",
	"52": "Хабаровский край",
	"53": "Смоленская область",
	"54": "Ханты-Мансийский АО",
	"55": "Челябинская область",
	"56": "Самарская область",
	"57": "Тульская область",
	"58": "Тамбовская область",
	"59": "Тюменская область",
	"60": "Свердловская область",
	"61": "Сахалинская область",
	"62": "Рязанская область",
	"63": "Республика Алтай",
	"64": "Чувашия",
	"65": "Чукотский АО",
	"66": "Брянская область",
	"67": "Еврейская АО",
	"68": "Алтайский край",
	"69": "Калининградская область",
	"70": "Архангельская область",
	"71": "Кемеровская область",
	"72": "Амурская область",
	"73": "Воронежская область",
	"74": "Красноярский край",
	"75": "Ненецкий АО",
	"76": "Тыва",
	"77": "Коми",
	"78": "Новосибирская область",
	"79": "Саратовская область",
	"80": "Ленинградская область",
	"81": "Московская область",
	"82": "Крым",
}


def parser():
	url = 'https://www.domofond.ru/prodazha-uchastkizemli-leningradskaya_oblast-r'
	for i in range(44, 83):
		try:
			soup = bs(
				requests.get(f'{url}{i}?Page=1',
							 headers=HEADERS).content, 'html.parser')
			el = soup.find('h1', 'search-results__title___2go0Q').get_text().split('— ')[1]
			city[str(i)] = el
			for x, y in city.items():
				print(f'"{x}": "{y}",')
			print()
		except Exception as e:
			print(e)
			continue


if __name__ == "__main__":
	print(city)
